draft/blog.org
#+hugo_base_dir: ../
#+hugo_selection: ./
#+options: author:nil

** DONE Google Cloud Database EngineerをはじめGoogle Cloudの資格をいくつか取得しました :gcp:certification:
CLOSED: [2022-11-22 Tue 22:45]
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :archives '(2022 2022-11)
:EXPORT_FILE_NAME: 202211222244
:END:

AWSの資格を全部取得してしまったので、Google Cloudの資格もいくつか取ってみるか、ということで取ってみました。

せっかくなので、それぞれの所感を簡単にまとめておきます。

*** Professional Cloud Architect
正確には最近取った資格ではなく、2019年に取得しました。
一度取った資格を、延長のために再受験することにモチベーションを保てず気付いたら失効させてしまっていました。
まあ、一度取っていれば自身のスキルを示すという観点では十分なんじゃないでしょうか。

とはいえ本資格は、自身のクラウドエンジニアとしてのキャリア上、一番始めに取得した資格(この後にAWS SAAとか取りました)なので、思い出深い資格ではあります。

このあと何回か触れるでしょうが、Google Cloudの資格は、結構Google Cloudのことを知らなくてもクラウドネイティブ設計とは、ってことがわかれば答えられるので受験難易度は低いと思います。
その分、PCA持ってるぜい!って設計とかレビューとかしようとするとGoogle Cloudのこと何も知らないので苦労することに……

*** Professional Database Engineer
2022年にGAになったばかりの比較的新しい資格で、まだ英語版の問題しか提供されていません。
最近、業務でも英語を使わざるを得なくなってきたものの、なんとなく苦手意識を感じていたのでテコ入れのために受験しました。

50問を2時間で解くということで問題文の解釈に多少は神経を使ったものの、
問題文と回答文なので簡潔にわかりやすく書かれており、問われる範囲も狭いのでそこまで難易度は高くないという印象でした。

基本的には、Cloud SQL、BigTable、Firebase、SpannerといったGoogle Cloudの代表的なデータベースサービスの概要とユースケースがわかり、
CloudSQLについてはサイジングとデータ移行、高可用性設計がわかればそんなに苦労はしないかと思います。

*** Professional Cloud Developer
今はクラウドエンジニアですが、以前はアプリケーション開発のキャリアだったので、
いつかは挑戦しようと思ってずるずるとここまで1年ぐらい来てしまっていたのですが、
試験範囲改訂されるということを知り駆け込みであわてて受験しました。
新範囲のgrpcなどは概要しか知らず使ったことがなかったので自身がなかったのじゃ…

これも、権限周り(GKEのサービスアカウントとGoogle CloudのIAMの連携とか)以外は、
Google Cloudに限らない一般的な開発知識が問われるので、駆け込みでも十分間に合ったなという印象です。

*** Professional Data Engineer
Database Engineerと名前が近く混同しがちですが、こちらはBigQueryとかその周辺のData Fusionなどが主体で問われます。
業務で最近BigQueryを使うことがあったので取ってみました。

これはさすがにGoogle Cloudのことをちゃんと問われますが、そこまで難易度は高くないかと思いました。

*** まとめ
AWSの資格と比べ、学習教材の量だと圧倒的に少ないGoogle Cloudの資格ですが、
難易度は良い意味で全体的に低め(変なことを聞かれないので、知るべきことを知ってれば対策不要)というのが特徴かと思います。

めぼしい資格は取ってしまったのでしばらくお休みかなと思いますが、おもしろそうなのがあれば取りにいきたいですね。
これで失効までの期間が2年ではなくもっと伸びてくれれば最高なのですが、なんとかならないですかね。

